# Ex3 - Getting and Knowing your Data

This time we are going to pull data directly from the internet.
Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [1]:
from pyspark.sql import SparkSession
import pandas as pd
spark = SparkSession.builder\
                    .appName('ocupation')\
                    .getOrCreate()

25/05/29 11:28:56 WARN Utils: Your hostname, kevin-llanos-Type1ProductConfigId resolves to a loopback address: 127.0.1.1; using 192.168.1.92 instead (on interface wlo1)
25/05/29 11:28:56 WARN Utils: Set SPARK_LOCAL_IP if you need to bind to another address
Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).
25/05/29 11:28:57 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

### Step 3. Assign it to a variable called users and use the 'user_id' as index

In [2]:
import requests

url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'

response = requests.get(url)

with open('data.csv', 'w', encoding='utf-8') as f:
    f.write(response.text)

print("Archivo guardado como data.csv")


occupation = spark.read.csv('data.csv', header=True, sep='|')
df = pd.read_csv('data.csv', header='infer', sep='|', )

Archivo guardado como data.csv

### Step 4. See the first 25 entries

In [3]:
occupation.show(25)

+-------+---+------+-------------+--------+
|user_id|age|gender|   occupation|zip_code|
+-------+---+------+-------------+--------+
|      1| 24|     M|   technician|   85711|
|      2| 53|     F|        other|   94043|
|      3| 23|     M|       writer|   32067|
|      4| 24|     M|   technician|   43537|
|      5| 33|     F|        other|   15213|
|      6| 42|     M|    executive|   98101|
|      7| 57|     M|administrator|   91344|
|      8| 36|     M|administrator|   05201|
|      9| 29|     M|      student|   01002|
|     10| 53|     M|       lawyer|   90703|
|     11| 39|     F|        other|   30329|
|     12| 28|     F|        other|   06405|
|     13| 47|     M|     educator|   29206|
|     14| 45|     M|    scientist|   55106|
|     15| 49|     F|     educator|   97301|
|     16| 21|     M|entertainment|   10309|
|     17| 30|     M|   programmer|   06355|
|     18| 35|     F|        other|   37212|
|     19| 40|     M|    librarian|   02138|
|     20| 42|     F|    homemaker|   95660|
|     21| 26|     M|       writer|   30068|
|     22| 25|     M|       writer|   40206|
|     23| 30|     F|       artist|   48197|
|     24| 21|     F|       artist|   94533|
|     25| 39|     M|     engineer|   55107|
+-------+---+------+-------------+--------+
only showing top 25 rows

In [4]:
df.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

### Step 5. See the last 10 entries

In [5]:
occupation.tail(25)

[Row(user_id='919', age='25', gender='M', occupation='other', zip_code='14216'),
 Row(user_id='920', age='30', gender='F', occupation='artist', zip_code='90008'),
 Row(user_id='921', age='20', gender='F', occupation='student', zip_code='98801'),
 Row(user_id='922', age='29', gender='F', occupation='administrator', zip_code='21114'),
 Row(user_id='923', age='21', gender='M', occupation='student', zip_code='E2E3R'),
 Row(user_id='924', age='29', gender='M', occupation='other', zip_code='11753'),
 Row(user_id='925', age='18', gender='F', occupation='salesman', zip_code='49036'),
 Row(user_id='926', age='49', gender='M', occupation='entertainment', zip_code='01701'),
 Row(user_id='927', age='23', gender='M', occupation='programmer', zip_code='55428'),
 Row(user_id='928', age='21', gender='M', occupation='student', zip_code='55408'),
 Row(user_id='929', age='44', gender='M', occupation='scientist', zip_code='53711'),
 Row(user_id='930', age='28', gender='F', occupation='scientist', zip_code='07310'),
 Row(user_id='931', age='60', gender='M', occupation='educator', zip_code='33556'),
 Row(user_id='932', age='58', gender='M', occupation='educator', zip_code='06437'),
 Row(user_id='933', age='28', gender='M', occupation='student', zip_code='48105'),
 Row(user_id='934', age='61', gender='M', occupation='engineer', zip_code='22902'),
 Row(user_id='935', age='42', gender='M', occupation='doctor', zip_code='66221'),
 Row(user_id='936', age='24', gender='M', occupation='other', zip_code='32789'),
 Row(user_id='937', age='48', gender='M', occupation='educator', zip_code='98072'),
 Row(user_id='938', age='38', gender='F', occupation='technician', zip_code='55038'),
 Row(user_id='939', age='26', gender='F', occupation='student', zip_code='33319'),
 Row(user_id='940', age='32', gender='M', occupation='administrator', zip_code='02215'),
 Row(user_id='941', age='20', gender='M', occupation='student', zip_code='97229'),
 Row(user_id='942', age='48', gender='F', occupation='librarian', zip_code='78209'),
 Row(user_id='943', age='22', gender='M', occupation='student', zip_code='77841')]

In [6]:
tail_= occupation.tail(25)

tail_df= spark.createDataFrame(tail_)

tail_df.show()

+-------+---+------+-------------+--------+
|user_id|age|gender|   occupation|zip_code|
+-------+---+------+-------------+--------+
|    919| 25|     M|        other|   14216|
|    920| 30|     F|       artist|   90008|
|    921| 20|     F|      student|   98801|
|    922| 29|     F|administrator|   21114|
|    923| 21|     M|      student|   E2E3R|
|    924| 29|     M|        other|   11753|
|    925| 18|     F|     salesman|   49036|
|    926| 49|     M|entertainment|   01701|
|    927| 23|     M|   programmer|   55428|
|    928| 21|     M|      student|   55408|
|    929| 44|     M|    scientist|   53711|
|    930| 28|     F|    scientist|   07310|
|    931| 60|     M|     educator|   33556|
|    932| 58|     M|     educator|   06437|
|    933| 28|     M|      student|   48105|
|    934| 61|     M|     engineer|   22902|
|    935| 42|     M|       doctor|   66221|
|    936| 24|     M|        other|   32789|
|    937| 48|     M|     educator|   98072|
|    938| 38|     F|   technician|   55038|
+-------+---+------+-------------+--------+
only showing top 20 rows

In [7]:
df.tail(25)

     user_id  age gender     occupation zip_code
918      919   25      M          other    14216
919      920   30      F         artist    90008
920      921   20      F        student    98801
921      922   29      F  administrator    21114
922      923   21      M        student    E2E3R
923      924   29      M          other    11753
924      925   18      F       salesman    49036
925      926   49      M  entertainment    01701
926      927   23      M     programmer    55428
927      928   21      M        student    55408
928      929   44      M      scientist    53711
929      930   28      F      scientist    07310
930      931   60      M       educator    33556
931      932   58      M       educator    06437
932      933   28      M        student    48105
933      934   61      M       engineer    22902
934      935   42      M         doctor    66221
935      936   24      M          other    32789
936      937   48      M       educator    98072
937      938   38      F     technician    55038
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

### Step 6. What is the number of observations in the dataset?

In [8]:
from pyspark.sql.functions import col, count_distinct
occupation.select(count_distinct('user_id').alias('total_observaciones')).show()

25/05/29 11:29:09 WARN GarbageCollectionMetrics: To enable non-built-in garbage collector(s) List(G1 Concurrent GC), users should configure it(them) to spark.eventLog.gcMetrics.youngGenerationGarbageCollectors or spark.eventLog.gcMetrics.oldGenerationGarbageCollectors

+-------------------+
|total_observaciones|
+-------------------+
|                943|
+-------------------+

In [9]:
n_observaciones = df['user_id'].nunique()

print('El total de observaciones es de %d' %n_observaciones)

El total de observaciones es de 943

### Step 7. What is the number of columns in the dataset?

In [10]:
n_cols = len(occupation.columns)

print('El total de columnas es de %d' %n_cols)

El total de columnas es de 5

In [11]:
cols_len = df.shape[1]

print('El total de columnas es de %d' %cols_len)

El total de columnas es de 5

### Step 8. Print the name of all the columns.

In [18]:
' '.join( f'Column {i} {col} --' for i, col in enumerate(occupation.columns, start=1))

'Column 1 user_id -- Column 2 age -- Column 3 gender -- Column 4 occupation -- Column 5 zip_code --'

In [19]:
' '.join( f'Column {i} {col} --' for i, col in enumerate(df.columns, start=1))

'Column 1 user_id -- Column 2 age -- Column 3 gender -- Column 4 occupation -- Column 5 zip_code --'

### Step 9. How is the dataset indexed?

### Step 10. What is the data type of each column?

### Step 11. Print only the occupation column

### Step 12. How many different occupations are in this dataset?

### Step 13. What is the most frequent occupation?

### Step 14. Summarize the DataFrame.

### Step 15. Summarize all the columns

### Step 16. Summarize only the occupation column

### Step 17. What is the mean age of users?

### Step 18. What is the age with least occurrence?